

INSERT INTO courses(title, description, scheduled_hours, special_department, department_id)
VALUES ('Анализ данных и визуализация','Курс, в котором студенты учатся анализировать данные, применять статистические методы и создавать визуализации для их наглядного представления',45,TRUE,1),
('Разработка приложений на Flutter','Курс, где студенты изучают разработку кросс-платформенных приложений с использованием фреймворка Flutter',120,TRUE,1),
('Безопасность приложений','Курс, посвященный обеспечению безопасности веб-приложений, идентификации уязвимостей и защите от атак',50,TRUE,2),
('Data Science','Курс, где студенты изучают методы анализа данных, машинного обучения и принятия решений на основе данных.',55,FALSE,4),
('Разработка игр на Unity','Курс, где студенты изучают разработку компьютерных игр с использованием среды разработки Unity.',70,TRUE,6),
('Программирование на JavaScript','Курс, где студенты изучают основы программирования на языке JavaScript и разработку веб-приложений.',50,TRUE,5),
('Компьютерные сети','Курс, в котором студенты изучают принципы работы и основные протоколы компьютерных сетей',45,TRUE,1),
('Разработка веб-серверов','Курс, где студенты обучаются созданию и настройке веб-серверов, а также основам веб-разработки на серверной стороне',60,FALSE,3),
('Мобильная разработка на Kotlin','Курс, на котором студенты изучают разработку мобильных приложений на языке Kotlin для платформы Android.',50,TRUE,2),
('Информационные системы','Курс, где студенты изучают концепции и принципы информационных систем, их разработку и внедрение.',55,TRUE,4),
('Разработка приложений для машинного обучения','Курс, где студенты изучают разработку приложений, основанных на методах машинного обучения и искусственного интеллекта.',70,TRUE,6),
('Разработка приложений для машинного обучения','Курс, где студенты изучают разработку приложений, основанных на методах машинного обучения и искусственного интеллекта',120,TRUE,1),
('Блокчейн технологии','Курс, в котором студенты изучают основы блокчейн технологий, криптовалют и смарт-контрактов.',70,TRUE,6),
('Тестирование программного обеспечения','Курс, в котором студенты учатся тестированию программного обеспечения, методам контроля качества и автоматизации тестирования.',45,FALSE,1),
('Разработка приложений на Django','Курс, где студенты изучают разработку веб-приложений с использованием фреймворка Django на языке Python.',60,TRUE,3),
('Аналитика больших данных и машинное обучение','Курс, в котором студенты изучают методы анализа больших данных и применение алгоритмов машинного обучения для извлечения информации.',50,TRUE,2),
('Управление проектами в IT','Курс, где студенты учатся принципам и методологиям управления проектами в области информационных технологий.',120,TRUE,1),
('Разработка нативных мобильных приложений на Swift','Курс, где студенты изучают разработку нативных мобильных приложений на языке Swift для платформы iOS.',70,TRUE,6),
('Программирование на Go','Курс, где студенты изучают программирование на языке Go и разработку высокопроизводительных приложений.',50,TRUE,5),
('Введение в программирование','Курс для начинающих, в котором изучаются основы программирования на языке Python',40,TRUE,1), 
('Веб-разработка','Курс, посвященный созданию динамических веб-приложений с использованием HTML, CSS и JavaScript',60,TRUE,3), 
('Алгоритмы и структуры данных','Курс, в котором изучаются основные алгоритмы и структуры данных',50,TRUE,2), 
('Базы данных','Курс, посвященный основам работы с реляционными базами данных и языком SQL',45,FALSE,4), 
('Машинное обучение','Введение в машинное обучение и анализ данных',70,TRUE,6), 
('Криптография','Курс, посвященный основам криптографии и защите информации',55,FALSE,5), 
('Разработка мобильных приложений','Курс, на котором студенты изучают разработку мобильных приложений для операционных систем iOS и Android',60,TRUE,1), 
('Сетевые технологии','Курс, посвященный основам сетевых технологий, протоколам и архитектуре сетей',50,TRUE,3), 
('Автоматизация тестирования','Курс, где студенты изучают основные методы и инструменты автоматизированного тестирования программного обеспечения',45,TRUE,2), 
('Информационная безопасность','Курс, посвященный основам информационной безопасности, защите данных и противодействию кибератакам',55,TRUE,4), 
('Искусственный интеллект','Курс, который знакомит студентов с основами искусственного интеллекта, алгоритмами машинного обучения и нейронными сетями',70,TRUE,6), 
('Программирование на Java','Курс, где студенты изучают программирование на языке Java и разработку приложений с использованием этого языка',50,TRUE,5), 
('Архитектура компьютеров','Курс, в котором студенты изучают основы архитектуры компьютеров, включая центральные процессоры, память и периферийные устройства',45,TRUE,1), 
('Фронтенд разработка','Курс, посвященный разработке пользовательского интерфейса для веб-приложений с использованием HTML, CSS и JavaScript',60,FALSE,3), 
('Big Data и аналитика','Курс, где студенты изучают основы обработки и анализа больших объемов данных, а также работу с платформами для Big Data',50,TRUE,2), 
('Компьютерная графика','Курс, охватывающий основы компьютерной графики, включая алгоритмы рендеринга, моделирование и визуализацию',55,FALSE,4), 
('Разработка мобильных игр','Курс, посвященный разработке игр для мобильных платформ, включая основы геймдизайна и использование игровых движков',70,TRUE,6), 
('Программирование на C++','Курс, где студенты изучают программирование на языке C++ и разработку высокоэффективного программного обеспечения',50,TRUE,5), 
('Интернет вещей (IoT)','Курс, в котором студенты узнают о технологиях Интернета вещей, включая сенсоры, микроконтроллеры и передачу данных',45,TRUE,1), 
('Безопасность сетей','Курс, который знакомит студентов с методами обнаружения, предотвращения и реагирования на угрозы в компьютерных сетях',60,FALSE,3), 
('Разработка мобильных приложений на React Native','Курс, где студенты изучают разработку переносимых мобильных приложений с использованием React Native',50,TRUE,2), 
('DevOps','Курс, который объединяет разработку программного обеспечения (Development) и управление операционной средой (Operations)',55,FALSE,4), 
('Компьютерная архитектура и организация вычислительных систем','Курс, в котором студенты изучают архитектуру и организацию компьютерных систем, включая принципы работы процессоров и памяти',70,TRUE,6), 
('Программирование на Ruby','Курс, в котором студенты изучают программирование на языке Ruby и разработку веб-приложений с использованием Ruby on Rails',50,TRUE,5),
('Безопасность веб-приложений','Курс, посвященный обеспечению безопасности веб-приложений, идентификации уязвимостей и противодействию атакам',50,TRUE,2),
('Облачные вычисления','Курс, в котором студенты изучают основы облачных вычислений, включая развертывание и управление приложениями в облачных средах',55,FALSE,4),
('Разработка алгоритмов','Курс, где студенты изучают разработку эффективных алгоритмов и структур данных для решения различных задач',70,TRUE,6);


























